stresstest/myServerReport
{
  "aggregate": {
    "counters": {
      "vusers.created_by_name.0": 43200,
      "vusers.created": 43200,
      "http.requests": 43200,
      "http.codes.200": 7691,
      "http.responses": 7691,
      "vusers.failed": 35509,
      "vusers.completed": 7691,
      "errors.ETIMEDOUT": 31804,
      "errors.ECONNRESET": 39,
      "errors.ENOTFOUND": 3666
    },
    "rates": {
      "http.request_rate": 169
    },
    "firstCounterAt": 1668946587230,
    "firstHistogramAt": 1668946587282,
    "lastCounterAt": 1668946837742,
    "lastHistogramAt": 1668946836737,
    "firstMetricAt": 1668946587230,
    "lastMetricAt": 1668946837742,
    "period": 1668946830000,
    "summaries": {
      "http.response_time": {
        "min": 6,
        "max": 48,
        "count": 7691,
        "p50": 12.1,
        "median": 12.1,
        "p75": 19.1,
        "p90": 21.1,
        "p95": 24.8,
        "p99": 32.1,
        "p999": 40
      },
      "vusers.session_length": {
        "min": 22,
        "max": 9992.6,
        "count": 7691,
        "p50": 3072.4,
        "median": 3072.4,
        "p75": 5711.5,
        "p90": 7709.8,
        "p95": 8692.8,
        "p99": 9607.1,
        "p999": 9999.2
      }
    },
    "histograms": {
      "http.response_time": {
        "min": 6,
        "max": 48,
        "count": 7691,
        "p50": 12.1,
        "median": 12.1,
        "p75": 19.1,
        "p90": 21.1,
        "p95": 24.8,
        "p99": 32.1,
        "p999": 40
      },
      "vusers.session_length": {
        "min": 22,
        "max": 9992.6,
        "count": 7691,
        "p50": 3072.4,
        "median": 3072.4,
        "p75": 5711.5,
        "p90": 7709.8,
        "p95": 8692.8,
        "p99": 9607.1,
        "p999": 9999.2
      }
    }
  },
  "intermediate": [
    {
      "counters": {
        "vusers.created_by_name.0": 450,
        "vusers.created": 450,
        "http.requests": 450,
        "http.codes.200": 244,
        "http.responses": 244,
        "vusers.failed": 0,
        "vusers.completed": 244
      },
      "rates": {
        "http.request_rate": 185
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946587230,
      "firstHistogramAt": 1668946587282,
      "lastCounterAt": 1668946589998,
      "lastHistogramAt": 1668946589971,
      "firstMetricAt": 1668946587230,
      "lastMetricAt": 1668946589998,
      "period": "1668946580000",
      "summaries": {
        "http.response_time": {
          "min": 11,
          "max": 45,
          "count": 244,
          "p50": 15,
          "median": 15,
          "p75": 21.1,
          "p90": 25.8,
          "p95": 30.3,
          "p99": 37.7,
          "p999": 40.9
        },
        "vusers.session_length": {
          "min": 24.5,
          "max": 1620.5,
          "count": 244,
          "p50": 53,
          "median": 53,
          "p75": 278.7,
          "p90": 347.3,
          "p95": 1064.4,
          "p99": 1525.7,
          "p999": 1525.7
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 11,
          "max": 45,
          "count": 244,
          "p50": 15,
          "median": 15,
          "p75": 21.1,
          "p90": 25.8,
          "p95": 30.3,
          "p99": 37.7,
          "p999": 40.9
        },
        "vusers.session_length": {
          "min": 24.5,
          "max": 1620.5,
          "count": 244,
          "p50": 53,
          "median": 53,
          "p75": 278.7,
          "p90": 347.3,
          "p95": 1064.4,
          "p99": 1525.7,
          "p999": 1525.7
        }
      }
    },
    {
      "counters": {
        "http.codes.200": 507,
        "http.responses": 507,
        "vusers.failed": 89,
        "vusers.completed": 507,
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "errors.ETIMEDOUT": 89
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946590000,
      "firstHistogramAt": 1668946590000,
      "lastCounterAt": 1668946599997,
      "lastHistogramAt": 1668946599987,
      "firstMetricAt": 1668946590000,
      "lastMetricAt": 1668946599997,
      "period": "1668946590000",
      "summaries": {
        "http.response_time": {
          "min": 10,
          "max": 42,
          "count": 507,
          "p50": 13.1,
          "median": 13.1,
          "p75": 19.1,
          "p90": 21.1,
          "p95": 23.8,
          "p99": 30.9,
          "p999": 40.9
        },
        "vusers.session_length": {
          "min": 23.2,
          "max": 9287.6,
          "count": 507,
          "p50": 1525.7,
          "median": 1525.7,
          "p75": 3534.1,
          "p90": 5826.9,
          "p95": 7117,
          "p99": 8692.8,
          "p999": 9047.6
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 10,
          "max": 42,
          "count": 507,
          "p50": 13.1,
          "median": 13.1,
          "p75": 19.1,
          "p90": 21.1,
          "p95": 23.8,
          "p99": 30.9,
          "p999": 40.9
        },
        "vusers.session_length": {
          "min": 23.2,
          "max": 9287.6,
          "count": 507,
          "p50": 1525.7,
          "median": 1525.7,
          "p75": 3534.1,
          "p90": 5826.9,
          "p95": 7117,
          "p99": 8692.8,
          "p999": 9047.6
        }
      }
    },
    {
      "counters": {
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "errors.ETIMEDOUT": 1238,
        "vusers.failed": 1238,
        "http.codes.200": 471,
        "http.responses": 471,
        "vusers.completed": 471
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946600001,
      "firstHistogramAt": 1668946600001,
      "lastCounterAt": 1668946609998,
      "lastHistogramAt": 1668946609967,
      "firstMetricAt": 1668946600001,
      "lastMetricAt": 1668946609998,
      "period": "1668946600000",
      "summaries": {
        "http.response_time": {
          "min": 10,
          "max": 39,
          "count": 471,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 19.9,
          "p95": 22.9,
          "p99": 29.1,
          "p999": 37
        },
        "vusers.session_length": {
          "min": 23.8,
          "max": 9992.6,
          "count": 471,
          "p50": 3072.4,
          "median": 3072.4,
          "p75": 6187.2,
          "p90": 7865.6,
          "p95": 8692.8,
          "p99": 9607.1,
          "p999": 9999.2
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 10,
          "max": 39,
          "count": 471,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 19.9,
          "p95": 22.9,
          "p99": 29.1,
          "p999": 37
        },
        "vusers.session_length": {
          "min": 23.8,
          "max": 9992.6,
          "count": 471,
          "p50": 3072.4,
          "median": 3072.4,
          "p75": 6187.2,
          "p90": 7865.6,
          "p95": 8692.8,
          "p99": 9607.1,
          "p999": 9999.2
        }
      }
    },
    {
      "counters": {
        "http.codes.200": 427,
        "http.responses": 427,
        "vusers.failed": 1345,
        "vusers.completed": 427,
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "errors.ETIMEDOUT": 1341,
        "errors.ECONNRESET": 4
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946610001,
      "firstHistogramAt": 1668946610004,
      "lastCounterAt": 1668946619998,
      "lastHistogramAt": 1668946619991,
      "firstMetricAt": 1668946610001,
      "lastMetricAt": 1668946619998,
      "period": "1668946610000",
      "summaries": {
        "http.response_time": {
          "min": 10,
          "max": 36,
          "count": 427,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 21.1,
          "p95": 22.9,
          "p99": 27.9,
          "p999": 36.2
        },
        "vusers.session_length": {
          "min": 23.4,
          "max": 9982.2,
          "count": 427,
          "p50": 3134.5,
          "median": 3134.5,
          "p75": 5826.9,
          "p90": 7709.8,
          "p95": 8520.7,
          "p99": 9607.1,
          "p999": 9801.2
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 10,
          "max": 36,
          "count": 427,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 21.1,
          "p95": 22.9,
          "p99": 27.9,
          "p999": 36.2
        },
        "vusers.session_length": {
          "min": 23.4,
          "max": 9982.2,
          "count": 427,
          "p50": 3134.5,
          "median": 3134.5,
          "p75": 5826.9,
          "p90": 7709.8,
          "p95": 8520.7,
          "p99": 9607.1,
          "p999": 9801.2
        }
      }
    },
    {
      "counters": {
        "errors.ETIMEDOUT": 1372,
        "vusers.failed": 1374,
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "http.codes.200": 432,
        "http.responses": 432,
        "vusers.completed": 432,
        "errors.ECONNRESET": 2
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946620001,
      "firstHistogramAt": 1668946620017,
      "lastCounterAt": 1668946629998,
      "lastHistogramAt": 1668946629994,
      "firstMetricAt": 1668946620001,
      "lastMetricAt": 1668946629998,
      "period": "1668946620000",
      "summaries": {
        "http.response_time": {
          "min": 10,
          "max": 39,
          "count": 432,
          "p50": 13.1,
          "median": 13.1,
          "p75": 19.1,
          "p90": 22,
          "p95": 24.8,
          "p99": 30.9,
          "p999": 37
        },
        "vusers.session_length": {
          "min": 24,
          "max": 9986.3,
          "count": 432,
          "p50": 3072.4,
          "median": 3072.4,
          "p75": 5711.5,
          "p90": 7865.6,
          "p95": 8520.7,
          "p99": 9801.2,
          "p999": 9999.2
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 10,
          "max": 39,
          "count": 432,
          "p50": 13.1,
          "median": 13.1,
          "p75": 19.1,
          "p90": 22,
          "p95": 24.8,
          "p99": 30.9,
          "p999": 37
        },
        "vusers.session_length": {
          "min": 24,
          "max": 9986.3,
          "count": 432,
          "p50": 3072.4,
          "median": 3072.4,
          "p75": 5711.5,
          "p90": 7865.6,
          "p95": 8520.7,
          "p99": 9801.2,
          "p999": 9999.2
        }
      }
    },
    {
      "counters": {
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "errors.ETIMEDOUT": 1352,
        "vusers.failed": 1353,
        "http.codes.200": 450,
        "http.responses": 450,
        "vusers.completed": 450,
        "errors.ECONNRESET": 1
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946630001,
      "firstHistogramAt": 1668946630051,
      "lastCounterAt": 1668946639997,
      "lastHistogramAt": 1668946639984,
      "firstMetricAt": 1668946630001,
      "lastMetricAt": 1668946639997,
      "period": "1668946630000",
      "summaries": {
        "http.response_time": {
          "min": 9,
          "max": 35,
          "count": 450,
          "p50": 13.1,
          "median": 13.1,
          "p75": 19.1,
          "p90": 21.1,
          "p95": 24.8,
          "p99": 29.1,
          "p999": 34.1
        },
        "vusers.session_length": {
          "min": 22,
          "max": 9849.9,
          "count": 450,
          "p50": 3134.5,
          "median": 3134.5,
          "p75": 5711.5,
          "p90": 8186.6,
          "p95": 8692.8,
          "p99": 9607.1,
          "p999": 9801.2
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 9,
          "max": 35,
          "count": 450,
          "p50": 13.1,
          "median": 13.1,
          "p75": 19.1,
          "p90": 21.1,
          "p95": 24.8,
          "p99": 29.1,
          "p999": 34.1
        },
        "vusers.session_length": {
          "min": 22,
          "max": 9849.9,
          "count": 450,
          "p50": 3134.5,
          "median": 3134.5,
          "p75": 5711.5,
          "p90": 8186.6,
          "p95": 8692.8,
          "p99": 9607.1,
          "p999": 9801.2
        }
      }
    },
    {
      "counters": {
        "http.codes.200": 410,
        "http.responses": 410,
        "vusers.failed": 1375,
        "vusers.completed": 410,
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "errors.ETIMEDOUT": 1375
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946640001,
      "firstHistogramAt": 1668946640008,
      "lastCounterAt": 1668946649998,
      "lastHistogramAt": 1668946649940,
      "firstMetricAt": 1668946640001,
      "lastMetricAt": 1668946649998,
      "period": "1668946640000",
      "summaries": {
        "http.response_time": {
          "min": 10,
          "max": 36,
          "count": 410,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 19.9,
          "p95": 23.8,
          "p99": 26.8,
          "p999": 34.8
        },
        "vusers.session_length": {
          "min": 23.3,
          "max": 9955.7,
          "count": 410,
          "p50": 3262.4,
          "median": 3262.4,
          "p75": 5826.9,
          "p90": 7709.8,
          "p95": 8520.7,
          "p99": 9416.8,
          "p999": 9801.2
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 10,
          "max": 36,
          "count": 410,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 19.9,
          "p95": 23.8,
          "p99": 26.8,
          "p999": 34.8
        },
        "vusers.session_length": {
          "min": 23.3,
          "max": 9955.7,
          "count": 410,
          "p50": 3262.4,
          "median": 3262.4,
          "p75": 5826.9,
          "p90": 7709.8,
          "p95": 8520.7,
          "p99": 9416.8,
          "p999": 9801.2
        }
      }
    },
    {
      "counters": {
        "http.codes.200": 405,
        "http.responses": 405,
        "vusers.failed": 1390,
        "vusers.completed": 405,
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "errors.ETIMEDOUT": 1389,
        "errors.ECONNRESET": 1
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946650000,
      "firstHistogramAt": 1668946650000,
      "lastCounterAt": 1668946659997,
      "lastHistogramAt": 1668946659905,
      "firstMetricAt": 1668946650000,
      "lastMetricAt": 1668946659997,
      "period": "1668946650000",
      "summaries": {
        "http.response_time": {
          "min": 9,
          "max": 42,
          "count": 405,
          "p50": 13.1,
          "median": 13.1,
          "p75": 19.1,
          "p90": 22,
          "p95": 25.8,
          "p99": 34.1,
          "p999": 39.3
        },
        "vusers.session_length": {
          "min": 22.4,
          "max": 9868.6,
          "count": 405,
          "p50": 3072.4,
          "median": 3072.4,
          "p75": 6187.2,
          "p90": 8024.5,
          "p95": 9047.6,
          "p99": 9607.1,
          "p999": 9801.2
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 9,
          "max": 42,
          "count": 405,
          "p50": 13.1,
          "median": 13.1,
          "p75": 19.1,
          "p90": 22,
          "p95": 25.8,
          "p99": 34.1,
          "p999": 39.3
        },
        "vusers.session_length": {
          "min": 22.4,
          "max": 9868.6,
          "count": 405,
          "p50": 3072.4,
          "median": 3072.4,
          "p75": 6187.2,
          "p90": 8024.5,
          "p95": 9047.6,
          "p99": 9607.1,
          "p999": 9801.2
        }
      }
    },
    {
      "counters": {
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "errors.ETIMEDOUT": 1403,
        "vusers.failed": 1410,
        "http.codes.200": 401,
        "http.responses": 401,
        "vusers.completed": 401,
        "errors.ECONNRESET": 7
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946660001,
      "firstHistogramAt": 1668946660050,
      "lastCounterAt": 1668946669998,
      "lastHistogramAt": 1668946669976,
      "firstMetricAt": 1668946660001,
      "lastMetricAt": 1668946669998,
      "period": "1668946660000",
      "summaries": {
        "http.response_time": {
          "min": 10,
          "max": 35,
          "count": 401,
          "p50": 13.1,
          "median": 13.1,
          "p75": 19.1,
          "p90": 22.9,
          "p95": 24.8,
          "p99": 30.3,
          "p999": 34.1
        },
        "vusers.session_length": {
          "min": 24.6,
          "max": 9944.2,
          "count": 401,
          "p50": 3134.5,
          "median": 3134.5,
          "p75": 5711.5,
          "p90": 8024.5,
          "p95": 8868.4,
          "p99": 9607.1,
          "p999": 9999.2
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 10,
          "max": 35,
          "count": 401,
          "p50": 13.1,
          "median": 13.1,
          "p75": 19.1,
          "p90": 22.9,
          "p95": 24.8,
          "p99": 30.3,
          "p999": 34.1
        },
        "vusers.session_length": {
          "min": 24.6,
          "max": 9944.2,
          "count": 401,
          "p50": 3134.5,
          "median": 3134.5,
          "p75": 5711.5,
          "p90": 8024.5,
          "p95": 8868.4,
          "p99": 9607.1,
          "p999": 9999.2
        }
      }
    },
    {
      "counters": {
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "errors.ETIMEDOUT": 1386,
        "vusers.failed": 1390,
        "http.codes.200": 405,
        "http.responses": 405,
        "vusers.completed": 405,
        "errors.ECONNRESET": 4
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946670001,
      "firstHistogramAt": 1668946670007,
      "lastCounterAt": 1668946679998,
      "lastHistogramAt": 1668946679995,
      "firstMetricAt": 1668946670001,
      "lastMetricAt": 1668946679998,
      "period": "1668946670000",
      "summaries": {
        "http.response_time": {
          "min": 10,
          "max": 34,
          "count": 405,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 21.1,
          "p95": 23.8,
          "p99": 27.9,
          "p999": 34.1
        },
        "vusers.session_length": {
          "min": 23.8,
          "max": 9857.3,
          "count": 405,
          "p50": 3072.4,
          "median": 3072.4,
          "p75": 6312.2,
          "p90": 7865.6,
          "p95": 8692.8,
          "p99": 9607.1,
          "p999": 9801.2
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 10,
          "max": 34,
          "count": 405,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 21.1,
          "p95": 23.8,
          "p99": 27.9,
          "p999": 34.1
        },
        "vusers.session_length": {
          "min": 23.8,
          "max": 9857.3,
          "count": 405,
          "p50": 3072.4,
          "median": 3072.4,
          "p75": 6312.2,
          "p90": 7865.6,
          "p95": 8692.8,
          "p99": 9607.1,
          "p999": 9801.2
        }
      }
    },
    {
      "counters": {
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "errors.ETIMEDOUT": 1401,
        "vusers.failed": 1402,
        "http.codes.200": 390,
        "http.responses": 390,
        "vusers.completed": 390,
        "errors.ECONNRESET": 1
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946680001,
      "firstHistogramAt": 1668946680050,
      "lastCounterAt": 1668946689997,
      "lastHistogramAt": 1668946689996,
      "firstMetricAt": 1668946680001,
      "lastMetricAt": 1668946689997,
      "period": "1668946680000",
      "summaries": {
        "http.response_time": {
          "min": 10,
          "max": 38,
          "count": 390,
          "p50": 13.1,
          "median": 13.1,
          "p75": 19.9,
          "p90": 21.1,
          "p95": 24.8,
          "p99": 30.9,
          "p999": 32.8
        },
        "vusers.session_length": {
          "min": 23.1,
          "max": 9970.7,
          "count": 390,
          "p50": 3011.6,
          "median": 3011.6,
          "p75": 5598.4,
          "p90": 8024.5,
          "p95": 8692.8,
          "p99": 9801.2,
          "p999": 9999.2
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 10,
          "max": 38,
          "count": 390,
          "p50": 13.1,
          "median": 13.1,
          "p75": 19.9,
          "p90": 21.1,
          "p95": 24.8,
          "p99": 30.9,
          "p999": 32.8
        },
        "vusers.session_length": {
          "min": 23.1,
          "max": 9970.7,
          "count": 390,
          "p50": 3011.6,
          "median": 3011.6,
          "p75": 5598.4,
          "p90": 8024.5,
          "p95": 8692.8,
          "p99": 9801.2,
          "p999": 9999.2
        }
      }
    },
    {
      "counters": {
        "http.codes.200": 358,
        "http.responses": 358,
        "vusers.failed": 1395,
        "vusers.completed": 358,
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "errors.ETIMEDOUT": 1395
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946690001,
      "firstHistogramAt": 1668946690009,
      "lastCounterAt": 1668946699997,
      "lastHistogramAt": 1668946699583,
      "firstMetricAt": 1668946690001,
      "lastMetricAt": 1668946699997,
      "period": "1668946690000",
      "summaries": {
        "http.response_time": {
          "min": 10,
          "max": 33,
          "count": 358,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 21.1,
          "p95": 22.9,
          "p99": 29.1,
          "p999": 32.1
        },
        "vusers.session_length": {
          "min": 23.8,
          "max": 9639.4,
          "count": 358,
          "p50": 3072.4,
          "median": 3072.4,
          "p75": 5944.6,
          "p90": 7865.6,
          "p95": 9047.6,
          "p99": 9416.8,
          "p999": 9607.1
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 10,
          "max": 33,
          "count": 358,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 21.1,
          "p95": 22.9,
          "p99": 29.1,
          "p999": 32.1
        },
        "vusers.session_length": {
          "min": 23.8,
          "max": 9639.4,
          "count": 358,
          "p50": 3072.4,
          "median": 3072.4,
          "p75": 5944.6,
          "p90": 7865.6,
          "p95": 9047.6,
          "p99": 9416.8,
          "p999": 9607.1
        }
      }
    },
    {
      "counters": {
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "errors.ETIMEDOUT": 1584,
        "vusers.failed": 1584,
        "http.codes.200": 5,
        "http.responses": 5,
        "vusers.completed": 5
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946700001,
      "firstHistogramAt": 1668946700083,
      "lastCounterAt": 1668946709998,
      "lastHistogramAt": 1668946701875,
      "firstMetricAt": 1668946700001,
      "lastMetricAt": 1668946709998,
      "period": "1668946700000",
      "summaries": {
        "http.response_time": {
          "min": 12,
          "max": 13,
          "count": 5,
          "p50": 12.1,
          "median": 12.1,
          "p75": 12.1,
          "p90": 12.1,
          "p95": 12.1,
          "p99": 12.1,
          "p999": 12.1
        },
        "vusers.session_length": {
          "min": 5114.6,
          "max": 6978.4,
          "count": 5,
          "p50": 5826.9,
          "median": 5826.9,
          "p75": 6312.2,
          "p90": 6312.2,
          "p95": 6312.2,
          "p99": 6312.2,
          "p999": 6312.2
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 12,
          "max": 13,
          "count": 5,
          "p50": 12.1,
          "median": 12.1,
          "p75": 12.1,
          "p90": 12.1,
          "p95": 12.1,
          "p99": 12.1,
          "p999": 12.1
        },
        "vusers.session_length": {
          "min": 5114.6,
          "max": 6978.4,
          "count": 5,
          "p50": 5826.9,
          "median": 5826.9,
          "p75": 6312.2,
          "p90": 6312.2,
          "p95": 6312.2,
          "p99": 6312.2,
          "p999": 6312.2
        }
      }
    },
    {
      "counters": {
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "errors.ETIMEDOUT": 1800,
        "vusers.failed": 1800
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946710002,
      "lastCounterAt": 1668946719998,
      "firstMetricAt": 1668946710002,
      "lastMetricAt": 1668946719998,
      "period": "1668946710000",
      "summaries": {},
      "histograms": {}
    },
    {
      "counters": {
        "errors.ETIMEDOUT": 1800,
        "vusers.failed": 1945,
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "errors.ENOTFOUND": 145
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946720002,
      "lastCounterAt": 1668946729998,
      "firstMetricAt": 1668946720002,
      "lastMetricAt": 1668946729998,
      "period": "1668946720000",
      "summaries": {},
      "histograms": {}
    },
    {
      "counters": {
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "errors.ENOTFOUND": 1800,
        "vusers.failed": 3455,
        "errors.ETIMEDOUT": 1655
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946730002,
      "lastCounterAt": 1668946739998,
      "firstMetricAt": 1668946730002,
      "lastMetricAt": 1668946739998,
      "period": "1668946730000",
      "summaries": {},
      "histograms": {}
    },
    {
      "counters": {
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "errors.ENOTFOUND": 1721,
        "vusers.failed": 1721
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946740002,
      "lastCounterAt": 1668946749997,
      "firstMetricAt": 1668946740002,
      "lastMetricAt": 1668946749997,
      "period": "1668946740000",
      "summaries": {},
      "histograms": {}
    },
    {
      "counters": {
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "errors.ETIMEDOUT": 78,
        "vusers.failed": 78
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946750002,
      "lastCounterAt": 1668946759997,
      "firstMetricAt": 1668946750002,
      "lastMetricAt": 1668946759997,
      "period": "1668946750000",
      "summaries": {},
      "histograms": {}
    },
    {
      "counters": {
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "errors.ETIMEDOUT": 1790,
        "vusers.failed": 1790,
        "http.codes.200": 310,
        "http.responses": 310,
        "vusers.completed": 310
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946760001,
      "firstHistogramAt": 1668946762032,
      "lastCounterAt": 1668946769998,
      "lastHistogramAt": 1668946769960,
      "firstMetricAt": 1668946760001,
      "lastMetricAt": 1668946769998,
      "period": "1668946760000",
      "summaries": {
        "http.response_time": {
          "min": 10,
          "max": 36,
          "count": 310,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 19.9,
          "p95": 23.8,
          "p99": 29.1,
          "p999": 30.3
        },
        "vusers.session_length": {
          "min": 23.8,
          "max": 9738.4,
          "count": 310,
          "p50": 982.6,
          "median": 982.6,
          "p75": 2618.1,
          "p90": 4316.6,
          "p95": 6064.7,
          "p99": 8352,
          "p999": 9230.4
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 10,
          "max": 36,
          "count": 310,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 19.9,
          "p95": 23.8,
          "p99": 29.1,
          "p999": 30.3
        },
        "vusers.session_length": {
          "min": 23.8,
          "max": 9738.4,
          "count": 310,
          "p50": 982.6,
          "median": 982.6,
          "p75": 2618.1,
          "p90": 4316.6,
          "p95": 6064.7,
          "p99": 8352,
          "p999": 9230.4
        }
      }
    },
    {
      "counters": {
        "http.codes.200": 419,
        "http.responses": 419,
        "vusers.failed": 1356,
        "vusers.completed": 419,
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "errors.ETIMEDOUT": 1354,
        "errors.ECONNRESET": 2
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946770002,
      "firstHistogramAt": 1668946770033,
      "lastCounterAt": 1668946779998,
      "lastHistogramAt": 1668946779972,
      "firstMetricAt": 1668946770002,
      "lastMetricAt": 1668946779998,
      "period": "1668946770000",
      "summaries": {
        "http.response_time": {
          "min": 9,
          "max": 32,
          "count": 419,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 19.9,
          "p95": 19.9,
          "p99": 25.8,
          "p999": 27.9
        },
        "vusers.session_length": {
          "min": 24,
          "max": 9956.8,
          "count": 419,
          "p50": 2618.1,
          "median": 2618.1,
          "p75": 5711.5,
          "p90": 7260.8,
          "p95": 8024.5,
          "p99": 9230.4,
          "p999": 9801.2
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 9,
          "max": 32,
          "count": 419,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 19.9,
          "p95": 19.9,
          "p99": 25.8,
          "p999": 27.9
        },
        "vusers.session_length": {
          "min": 24,
          "max": 9956.8,
          "count": 419,
          "p50": 2618.1,
          "median": 2618.1,
          "p75": 5711.5,
          "p90": 7260.8,
          "p95": 8024.5,
          "p99": 9230.4,
          "p999": 9801.2
        }
      }
    },
    {
      "counters": {
        "http.codes.200": 364,
        "http.responses": 364,
        "vusers.failed": 1387,
        "vusers.completed": 364,
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "errors.ETIMEDOUT": 1386,
        "errors.ECONNRESET": 1
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946780002,
      "firstHistogramAt": 1668946780044,
      "lastCounterAt": 1668946789998,
      "lastHistogramAt": 1668946789986,
      "firstMetricAt": 1668946780002,
      "lastMetricAt": 1668946789998,
      "period": "1668946780000",
      "summaries": {
        "http.response_time": {
          "min": 9,
          "max": 40,
          "count": 364,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 19.9,
          "p95": 22.9,
          "p99": 30.3,
          "p999": 30.9
        },
        "vusers.session_length": {
          "min": 24.1,
          "max": 9966.3,
          "count": 364,
          "p50": 3262.4,
          "median": 3262.4,
          "p75": 6312.2,
          "p90": 7557.1,
          "p95": 9047.6,
          "p99": 9607.1,
          "p999": 9999.2
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 9,
          "max": 40,
          "count": 364,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 19.9,
          "p95": 22.9,
          "p99": 30.3,
          "p999": 30.9
        },
        "vusers.session_length": {
          "min": 24.1,
          "max": 9966.3,
          "count": 364,
          "p50": 3262.4,
          "median": 3262.4,
          "p75": 6312.2,
          "p90": 7557.1,
          "p95": 9047.6,
          "p99": 9607.1,
          "p999": 9999.2
        }
      }
    },
    {
      "counters": {
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "http.codes.200": 371,
        "http.responses": 371,
        "vusers.failed": 1451,
        "vusers.completed": 371,
        "errors.ETIMEDOUT": 1448,
        "errors.ECONNRESET": 3
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946790002,
      "firstHistogramAt": 1668946790034,
      "lastCounterAt": 1668946799998,
      "lastHistogramAt": 1668946799981,
      "firstMetricAt": 1668946790002,
      "lastMetricAt": 1668946799998,
      "period": "1668946790000",
      "summaries": {
        "http.response_time": {
          "min": 10,
          "max": 38,
          "count": 371,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 19.9,
          "p95": 21.1,
          "p99": 26.8,
          "p999": 34.8
        },
        "vusers.session_length": {
          "min": 23.6,
          "max": 9853.6,
          "count": 371,
          "p50": 3072.4,
          "median": 3072.4,
          "p75": 5711.5,
          "p90": 7117,
          "p95": 7865.6,
          "p99": 9607.1,
          "p999": 9801.2
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 10,
          "max": 38,
          "count": 371,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 19.9,
          "p95": 21.1,
          "p99": 26.8,
          "p999": 34.8
        },
        "vusers.session_length": {
          "min": 23.6,
          "max": 9853.6,
          "count": 371,
          "p50": 3072.4,
          "median": 3072.4,
          "p75": 5711.5,
          "p90": 7117,
          "p95": 7865.6,
          "p99": 9607.1,
          "p999": 9801.2
        }
      }
    },
    {
      "counters": {
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "http.codes.200": 370,
        "http.responses": 370,
        "vusers.failed": 1429,
        "vusers.completed": 370,
        "errors.ETIMEDOUT": 1426,
        "errors.ECONNRESET": 3
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946800002,
      "firstHistogramAt": 1668946800032,
      "lastCounterAt": 1668946809998,
      "lastHistogramAt": 1668946809993,
      "firstMetricAt": 1668946800002,
      "lastMetricAt": 1668946809998,
      "period": "1668946800000",
      "summaries": {
        "http.response_time": {
          "min": 6,
          "max": 46,
          "count": 370,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 22,
          "p95": 25.8,
          "p99": 32.1,
          "p999": 40.9
        },
        "vusers.session_length": {
          "min": 23.6,
          "max": 9829.6,
          "count": 370,
          "p50": 3072.4,
          "median": 3072.4,
          "p75": 5944.6,
          "p90": 7407.5,
          "p95": 8520.7,
          "p99": 9607.1,
          "p999": 9801.2
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 6,
          "max": 46,
          "count": 370,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 22,
          "p95": 25.8,
          "p99": 32.1,
          "p999": 40.9
        },
        "vusers.session_length": {
          "min": 23.6,
          "max": 9829.6,
          "count": 370,
          "p50": 3072.4,
          "median": 3072.4,
          "p75": 5944.6,
          "p90": 7407.5,
          "p95": 8520.7,
          "p99": 9607.1,
          "p999": 9801.2
        }
      }
    },
    {
      "counters": {
        "vusers.created_by_name.0": 1800,
        "vusers.created": 1800,
        "http.requests": 1800,
        "errors.ETIMEDOUT": 1409,
        "vusers.failed": 1413,
        "http.codes.200": 396,
        "http.responses": 396,
        "vusers.completed": 396,
        "errors.ECONNRESET": 4
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946810002,
      "firstHistogramAt": 1668946810002,
      "lastCounterAt": 1668946819998,
      "lastHistogramAt": 1668946819986,
      "firstMetricAt": 1668946810002,
      "lastMetricAt": 1668946819998,
      "period": "1668946810000",
      "summaries": {
        "http.response_time": {
          "min": 9,
          "max": 48,
          "count": 396,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 21.1,
          "p95": 23.8,
          "p99": 30.9,
          "p999": 39.3
        },
        "vusers.session_length": {
          "min": 24,
          "max": 9950.3,
          "count": 396,
          "p50": 3072.4,
          "median": 3072.4,
          "p75": 6187.2,
          "p90": 8520.7,
          "p95": 9230.4,
          "p99": 9801.2,
          "p999": 9801.2
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 9,
          "max": 48,
          "count": 396,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 21.1,
          "p95": 23.8,
          "p99": 30.9,
          "p999": 39.3
        },
        "vusers.session_length": {
          "min": 24,
          "max": 9950.3,
          "count": 396,
          "p50": 3072.4,
          "median": 3072.4,
          "p75": 6187.2,
          "p90": 8520.7,
          "p95": 9230.4,
          "p99": 9801.2,
          "p999": 9801.2
        }
      }
    },
    {
      "counters": {
        "http.codes.200": 400,
        "http.responses": 400,
        "vusers.failed": 1411,
        "vusers.completed": 400,
        "vusers.created_by_name.0": 1350,
        "vusers.created": 1350,
        "http.requests": 1350,
        "errors.ETIMEDOUT": 1411
      },
      "rates": {
        "http.request_rate": 180
      },
      "http.request_rate": null,
      "firstCounterAt": 1668946820002,
      "firstHistogramAt": 1668946820051,
      "lastCounterAt": 1668946829999,
      "lastHistogramAt": 1668946829996,
      "firstMetricAt": 1668946820002,
      "lastMetricAt": 1668946829999,
      "period": "1668946820000",
      "summaries": {
        "http.response_time": {
          "min": 9,
          "max": 37,
          "count": 400,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 22,
          "p95": 24.8,
          "p99": 36.2,
          "p999": 37
        },
        "vusers.session_length": {
          "min": 24.6,
          "max": 9992.3,
          "count": 400,
          "p50": 3072.4,
          "median": 3072.4,
          "p75": 6187.2,
          "p90": 7865.6,
          "p95": 9230.4,
          "p99": 9801.2,
          "p999": 9801.2
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 9,
          "max": 37,
          "count": 400,
          "p50": 12.1,
          "median": 12.1,
          "p75": 19.1,
          "p90": 22,
          "p95": 24.8,
          "p99": 36.2,
          "p999": 37
        },
        "vusers.session_length": {
          "min": 24.6,
          "max": 9992.3,
          "count": 400,
          "p50": 3072.4,
          "median": 3072.4,
          "p75": 6187.2,
          "p90": 7865.6,
          "p95": 9230.4,
          "p99": 9801.2,
          "p999": 9801.2
        }
      }
    },
    {
      "counters": {
        "errors.ETIMEDOUT": 922,
        "vusers.failed": 928,
        "http.codes.200": 156,
        "http.responses": 156,
        "vusers.completed": 156,
        "errors.ECONNRESET": 6
      },
      "rates": {},
      "firstCounterAt": 1668946830002,
      "firstHistogramAt": 1668946830002,
      "lastCounterAt": 1668946837742,
      "lastHistogramAt": 1668946836737,
      "firstMetricAt": 1668946830002,
      "lastMetricAt": 1668946837742,
      "period": "1668946830000",
      "summaries": {
        "http.response_time": {
          "min": 10,
          "max": 32,
          "count": 156,
          "p50": 13.1,
          "median": 13.1,
          "p75": 19.1,
          "p90": 19.9,
          "p95": 23.8,
          "p99": 27.9,
          "p999": 30.3
        },
        "vusers.session_length": {
          "min": 3054.3,
          "max": 9916.7,
          "count": 156,
          "p50": 7865.6,
          "median": 7865.6,
          "p75": 8868.4,
          "p90": 9230.4,
          "p95": 9607.1,
          "p99": 9801.2,
          "p999": 9801.2
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 10,
          "max": 32,
          "count": 156,
          "p50": 13.1,
          "median": 13.1,
          "p75": 19.1,
          "p90": 19.9,
          "p95": 23.8,
          "p99": 27.9,
          "p999": 30.3
        },
        "vusers.session_length": {
          "min": 3054.3,
          "max": 9916.7,
          "count": 156,
          "p50": 7865.6,
          "median": 7865.6,
          "p75": 8868.4,
          "p90": 9230.4,
          "p95": 9607.1,
          "p99": 9801.2,
          "p999": 9801.2
        }
      }
    }
  ]
}